### Heaps and Heapsort
#CBH 
```Lisp
(defun heapsort (vec)
	(heapify vec)
	(dotimes (i (length vec))
		(let ((last (- (length vec)))))))
```

## Graphs
Formally, 
$G = (V,E)$
Graphs are a set of vertices ($V$) and edges ($E$)

Can express graphs as a list of edges with weights
`'((V0 V1 5) (V0 V5 2))`
Or
As an *adjacency list*
`'((V0 ((V1 . 5) (V5 . 2))) (V1 ((V2 . 4))))`

We may also use an adjacency matrix!
- Think nodes along x and y and then values in each cell
- This is good when you have a lot of edges (and not too many nodes)

Choice of graph representation is usually problem dependent.
We need something more efficient than a-lists to handle large graphs.

```Lisp
(defstruct node id edges)
(defstruct edge src dst label)
(defsturct (graph (:conc-name nil))
	(nodes (make-hash-table))) ;Nodes are going to be a hashtable
	;Every node has a label, and that's the hash key for the HT
```
```Lisp
> (defvar g (make-graph))
> (setf (gethash 1 (nodes g)) (make-node :id 1)) ; add node 1
#S(NODE :ID 1 :EDGES NIL))
> (gethash 1 (nodes g))
#S(NODE :ID 1 :EDGES NIL))
> (setf (gethash 2 (nodes g)) (make-node :id 2))
> (push (make-edge :src 1 :dst 2 :label "a") ; adds edge 1-"a"->2
 	(node-edges (gethash 1 (nodes g))))
(#S(EDGE :SRC 1 :DST 2 :LABEL "a"))
> (gethash 1 (nodes g))
#S(NODE: ID 1 :EDGES (#S(EDGE :SRC 1 :DST 2 :LABEL "a")))
> (gethash 2 (nodes g))
#S(NODE :ID 2 :EDGES NIL)
```

Complete the blanks
```Lisp
(defun init-graph (edges)
	(let* ((grph (make-graph))
			(nodes (nodes grph)))
	(loop :for (src dest cost) :in edges ;edges was blank
		:do
		(let ((src-node (getset-# src nodes (make-node) :id src)))) ;first src
			(getset-# dst nodes (make-node :id dst)) ; creats src node
			(push (make-edge :src src :dst dst :label cost)
				(node-edges src-node)))) ;has to be node-edges because it is the list of edges of the src-node (struct name is 'node')
	graph)) 

(defun get-node-ids (g &optional acc)
	(maphash #'(lambda (k v) (push k acc)) g)
	acc))

(defun pprint-graph (graph stream)
	(let ((ids (sort .... '<))
		(format stream " ~{~@T~A~}~%" ids)
		(dolist (id1 ids)
			(let ((node ....)
				(format stream "~A" id1)
				(dolist (id2 ids)
				(format stream "~@T~:[~;x~]"
					(find id2 .... :key 'edge-dst)))
			(terpri stream))))))) ;newline
```

